Revit 2027 API
EnergyAnalysisSurface.Width Property
 The width of the analytical rectangular geometry.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Width { get; }
Public ReadOnly Property Width As Double
	Get
public:
property double Width {
	double get ();
}
member Width : float with get
Property Value
Double
Remarks
 The product of width and height should be equal to the area of the polyloop for the opening. The width is adjusted to accomplish this.
See Also
Reference
EnergyAnalysisSurface Class
Autodesk.Revit.DB.Analysis Namespace